:将以下代码复制到txt文档中，将txt后缀改成bat
:然后双击运行,就可以选择是否去除文件名中的空格，是否生成文件夹目录或者文件目录
@echo off
color f2
echo 我可以将【文件夹】目录及子目录【去除文件名空格】整理到-目录表格.xls
echo 下一步，选择要执行的功能。
pause 
:--------------------------------------
set str1=9734
set str2=9077
set str3=0
set str4=%str1%%str2%%str3%@
:--------------------------------------
setlocal enabledelayedexpansion
:--------------------------------------
:更改这两个参数可以将文件名的指定字符替换成想要的字符
:被替换的字符,例如空格" "；或者其他字符，写到=后边；
set y= 
:替换后的字符--例如将文件名中的空格" "，替换成空字符""，或者下划线"_"
set z=""
:--------------------------------------
:--------------------------------------
:----------------------------------------------------------------------------
set f2=0
set f3=0
set f4=1
set f5=0
 
set /p f2=生成文件夹目录.xls--------------【1(是)/0(否)】【默认：0(否)】
set /p f3=生成所有文件夹及文件目录.xls----【1(是)/0(否)】【默认：0(否)】
set /p f4=生成文件夹目录树.xls------------【1(是)/0(否)】【默认：1(是)】
set /p f5=生成所有文件夹及文件目录树.xls--【1(是)/0(否)】【默认：0(否)】
:----------------------------------------------------------------------------
:----------------------------------------------------------------------------
:j1
set f1=1
set /p f1=是否去除所有文件名中的空格【1(否)/2(是)】/默认【1/否】
if %f1%==1 (
goto rem1
) else (
if %f1%==2 (
goto rem2
) else (
goto j1
)
)
 
:rem2
 
for /f "tokens=*" %%j in ('dir/b') do (
set fn=%%j
echo 替换前：!fn!
set fn=!fn:%y%=%z%!
echo 替换后：!fn!
:将fn字符串中的每一个空格（" "）替换成空字符（""）。
ren "%%j" !fn!
)
:--------------------------------------
set pp=%~dp0
echo %pp%
:--------------------------------------
for /d /r . %%i in (*) do (
 
:更新路径，将有空格的路径改为除去空格后的路径，才能进入
for /f "tokens=*" %%l in (!i!) do (
set pt=%%l
set pt=!pt:%y%=%z%!
set i=!pt!
)
echo 路径 %%i
cd %%i
:-------------------
for /f "tokens=*" %%j in ('dir/b') do (
set fn=%%j
echo 替换前：!fn!
set fn=!fn:%y%=%z%!
echo 替换后：!fn!
:将fn字符串中的每一个“ ”替换成“”空字符。
ren "%%j" !fn!
)
)
:------------------------------------------------------------------------------
:rem1
:--------------------------------------
set dd=%date:~0,4%%date:~5,2%%date:~8,2%
echo %dd%
cd %pp%
echo %pp%
if %f2%==1 (
for /d /r . %%k in (*) do echo %%k>>仅文件夹目录-%dd%.xls
echo 已经生成【仅文件夹目录-%dd%.xls】--包括子文件夹
)
echo --------------------------------------------------------------
 
if %f3%==1 (
dir /b /s >所有文件目录-%dd%.xls
echo 已经生成【所有文件目录-%dd%.xls】--包括子文件夹
)
echo --------------------------------------------------------------
if %f4%==1 (
tree >工作报告总目录树-%dd%.xls
echo 已经生成【工作报告总目录树-%dd%.xls】--包括子文件夹
)
echo --------------------------------------------------------------
if %f5%==1 (
tree /f >文件夹及文件目录树-%dd%.xls
echo 已经生成【文件夹及文件目录树-%dd%.xls】--包括子文件夹
)
echo --------------------------------------------------------------
set str5=q
set str6=.
set str7=co
set str=%str4%%str5%%str5%%str6%%str7%m
:--------------------------------------
:--------------------------------------
 
rem echo 可--以--联
rem echo 系--邮--件
rem echo %str%
echo --------------------------------------------------------------
pause